In [ ]:
import pandas as pd
#pandas is data manupilation library use for data analysis and cleaning
#it is for 2d mutable hetrogenous tabular data

In [4]:
#series
#series is one dimension pandas object similar to array
data=[1,2,3,4,5,6,7]
series=pd.Series(data)
type(series)

pandas.core.series.Series

In [5]:
print(series)

0    1
1    2
2    3
3    4
4    5
5    6
6    7
dtype: int64

In [7]:
#series from dict
dic={'a':1,'b':2,"c":4,'d':5}
series_d=pd.Series(dic)
series_d

a    1
b    2
c    4
d    5
dtype: int64

In [8]:
data=[10,20,30]
index=['a','b','c']
pd.Series(data,index=index)

a    10
b    20
c    30
dtype: int64

In [9]:
#dataframe
#create a dataframe from dict
data={
    'name':['a','b','c','d'],
    'age':[3,5,6,7],
    'city':['del','mumb','chandi','del']
}
df=pd.DataFrame(data)
print(df)

  name  age    city
0    a    3     del
1    b    5    mumb
2    c    6  chandi
3    d    7     del

In [18]:
#creating data frame from a list of dict
data=[
    {'name':'s','age':34},
    {'name':'a','age':37},
    {'name':'f','age':35},
    {'name':'t','age':32}
]
df=pd.DataFrame(data)
print(df)

  name  age
0    s   34
1    a   37
2    f   35
3    t   32

In [36]:
df=pd.read_csv('sales_data.csv')
print(df.head())

   Transaction ID        Date Product Category             Product Name  \
0           10001  2024-01-01      Electronics            iPhone 14 Pro
1           10002  2024-01-02  Home Appliances         Dyson V11 Vacuum
2           10003  2024-01-03         Clothing         Levi's 501 Jeans
3           10004  2024-01-04            Books        The Da Vinci Code
4           10005  2024-01-05  Beauty Products  Neutrogena Skincare Set

   Units Sold  Unit Price  Total Revenue         Region Payment Method
0           2      999.99        1999.98  North America    Credit Card
1           1      499.99         499.99         Europe         PayPal
2           3       69.99         209.97           Asia     Debit Card
3           4       15.99          63.96  North America    Credit Card
4           1       89.99          89.99         Europe         PayPal

In [19]:
#accessing data
df

  name  age
0    s   34
1    a   37
2    f   35
3    t   32

In [ ]:
df['name'] #column

0    s
1    a
2    f
3    t
Name: name, dtype: object

In [ ]:
df.loc[0] #row

name     s
age     34
Name: 0, dtype: object

In [23]:
#accessing specified element
df.at[1,'age']

np.int64(37)

In [33]:

#data manupilation
#adding colun
df['salary']=[50000,45000,30000,53212]

In [ ]:
df
#removing column
df.drop('salary',axis=1) #temp drop

  name  age
0    s   34
1    a   37
2    f   35
3    t   32

In [34]:
df
#removing column
df.drop('salary',axis=1,inplace=True)

In [41]:
df=pd.read_csv('sales_data.csv')
print(df.head())

   Transaction ID        Date Product Category             Product Name  \
0           10001  2024-01-01      Electronics            iPhone 14 Pro
1           10002  2024-01-02  Home Appliances         Dyson V11 Vacuum
2           10003  2024-01-03         Clothing         Levi's 501 Jeans
3           10004  2024-01-04            Books        The Da Vinci Code
4           10005  2024-01-05  Beauty Products  Neutrogena Skincare Set

   Units Sold  Unit Price  Total Revenue         Region Payment Method
0           2      999.99        1999.98  North America    Credit Card
1           1      499.99         499.99         Europe         PayPal
2           3       69.99         209.97           Asia     Debit Card
3           4       15.99          63.96  North America    Credit Card
4           1       89.99          89.99         Europe         PayPal

In [42]:
#statistical summary
df.describe()

       Transaction ID  Units Sold   Unit Price  Total Revenue
count       240.00000  240.000000   240.000000     240.000000
mean      10120.50000    2.158333   236.395583     335.699375
std          69.42622    1.322454   429.446695     485.804469
min       10001.00000    1.000000     6.500000       6.500000
25%       10060.75000    1.000000    29.500000      62.965000
50%       10120.50000    2.000000    89.990000     179.970000
75%       10180.25000    3.000000   249.990000     399.225000
max       10240.00000   10.000000  3899.990000    3899.990000

In [43]:
#data types
df.dtypes

Transaction ID        int64
Date                 object
Product Category     object
Product Name         object
Units Sold            int64
Unit Price          float64
Total Revenue       float64
Region               object
Payment Method       object
dtype: object